{"author": "Victor Pinheiro", "body": "Outras soluções já usam tecnologia de deep learning para classificar galáxias, mas esses programas normalmente exigem que os pesquisadores observem a existência de um objeto para, na sequência, alimentar o algoritmo com novas imagens para identificar a galáxia correspondente. Já o modelo dos cientistas da UCSC usa como recurso os dados de imagens originais, e é capaz de identificar diferentes elementos de uma mesma galáxias.Classificação morfológica do Morpheus para região captada na imagem do Hubble Legacy Fields (Foto: Ryan Hausen/Phys.org)“O Morpheus descobre as galáxias para você e faz [essa análise] pixel por pixel. Ele pode lidar com imagens muito complicadas: você pode ter uma [estrutura] esferoidal ao lado de um disco, por exemplo. Para um disco com um objeto central, [o programa] classifica esse objeto separadamente.\", disse Brant Robertson, professor de astronomia e astrofísica da UCSC e um dos criadores do programa, ao Phys.org.Quando o Morpheus processa uma imagem de uma área do céu, o programa cria novos grupos de figuras da área capturada, e classifica todos os objetos com código de cores de acordo com sua morfologia. Assim, é possível separar os objetos astronômicos do fundo da imagem e identificar estrelas e diferentes tipos de galáxia.Com ajuda do supercomputador da UCSC, o Morpheus gera rapidamente a análise pixel por pixel para todo o conjunto de dados, assim como estabelece um nível de precisão para cada classificação.Robertson acredita que o principal impacto da nova tecnologia pode ser o aprimoramento da automatização de processos de pesquisa astronômica. Para ele, isso é essencial à medida que o volume de informações à disposição de cientistas cresce. O pesquisador cita como exemplo a pesquisa Legacy Survey of Space and Time (LSST), que será conduzida no Observatório Vera Rubin, ainda em construção no Chile.A expectativa é que o estudo de larga escala possa gerar enormes quantidades de dados de imagens, e Robertson está envolvido no planejamento de como usar essas informações para investigar a formação e a evolução de galáxias.\"Imagine se você pedisse a astrônomos que eles classifiquem bilhões de objetos. Como eles poderiam fazer isso? Agora, poderemos classificar automaticamente esses objetos e usar essas informações para aprender sobre a evolução das galáxias\", disse Robertson, em referência ao uso do Morpheus.", "title": "Cientistas criam programa poderoso que aprimora detecção de galáxias", "type": "article", "url": "https://olhardigital.com.br/ciencia-e-espaco/noticia/cientistas-criam-programa-poderoso-que-aprimora-deteccao-de-galaxias/100683"}