{"author": "Rafael Rigues", "body": "A IA está sendo usada para projetar partes do \"sistema portátil de suporte à vida\", a \"mochila\" que os astronautas carregam nas costas, que regula sua temperatura corporal, fornece energia e abriga o sistema de comunicação do traje.Em vez disso, ela está sendo usada para projetar braçadeiras e suportes que irão sustentar os sistemas que mantém os astronautas vivos. Pode não ser um trabalho glamouroso, mas graças à IA a Nasa conseguiu reduzir o peso de alguns componentes em até 50%.O xEMU é o traje que será usado nas missões do programa Artemis, que pretende levar uma mulher à Lua. Foto: Loren Grush / The Verge.\"Quando a Nasa define os requisitos para um sistema de pouso tripulado, ela aloca um certo peso para cada componente imaginável, que temos que respeitar\", diz Miller. \"Então, qualquer lugar onde possamos economizar mesmo um décimo de grama nos ajuda a chegar mais perto do limite de peso da missão\"Segundo Jesse Coors-Blankenship, Vice-Presidente de Tecnologia da PTC, empresa que desenvolveu o software usado pela Nasa, \"consideramos a IA como uma tecnologia que pode fazer algo mais rápido e melhor do que um humano treinado pode fazer. Algumas das tecnologias são coisas com as quais os engenheiros já estão acostumados, como simulação e otimização estrutural. Mas com a IA, podemos fazer isso mais rapidamente\".Segundo Jesse Craft, engenheiro sênior da Jacobs, empresa do Texas que foi contratada pela Nasa para auxiliar no projeto do xEMU, \"o processo iterativo das máquinas é 100 ou 1.000 vezes mais rápido do que poderíamos fazer sozinhos, e o resultado é uma solução que é idealmente otimizada para nossos requisitos\".", "title": "Inteligência artificial ajuda a Nasa a projetar novos trajes espaciais", "type": "article", "url": "https://olhardigital.com.br/ciencia-e-espaco/noticia/inteligencia-artificial-ajuda-a-nasa-a-projetar-novos-trajes-espaciais/102772"}